app/controllers/contacts_controller.rb

  def create
    @contact = current_user.contacts.build(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "phone", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Teste1"], ["phone", "teste1@gmail.com"], ["created_at", "2024-02-06 19:10:51.337466"], ["updated_at", "2024-02-06 19:10:51.337466"], ["user_id", 5]]

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "name" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["name", "Teste22"], ["updated_at", "2024-02-07 14:18:59.363346"], ["id", 4]]

  def destroy
    @contact.destroy!
---
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 1]]

    def set_contact
      @contact = current_user.contacts.find(params[:id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1 AND "contacts"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 3], ["LIMIT", 1]]