app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "ismael@gmail.com"], ["name", "Ismael"], ["password_digest", "[FILTERED]"], ["created_at", "2024-02-02 15:12:25.844078"], ["updated_at", "2024-02-02 15:12:25.844078"]]
---
  def create
      @user = User.new(user_params)
      if @user.save